In [2]:
%load_ext sql

In [3]:
%sql mysql+mysqldb://root:Ranasverdes3@localhost/publications

In [4]:
%%sql

SELECT table_name 
FROM information_schema.tables
WHERE table_schema='publications';

 * mysql+mysqldb://root:***@localhost/publications
11 rows affected.

[('authors',),
 ('discounts',),
 ('employee',),
 ('jobs',),
 ('pub_info',),
 ('publishers',),
 ('roysched',),
 ('sales',),
 ('stores',),
 ('titleauthor',),
 ('titles',)]

### Challenge 1 - Most Profiting Authors

In this challenge let's have a close look at the bonus challenge of the previous MySQL SELECT lab -- who are the top 3 most profiting authors? Even if you have solved or think you have solved that problem in the previous lab, please still complete this challenge because the step-by-step guidances are helpful to train your problem-solving thinking.

In order to solve this problem, it is important for you to keep the following points in mind:

In table sales, a title can appear several times. The royalties need to be calculated for each sale.

Despite a title can have multiple sales records, the advance must be calculated only once for each title.

In your eventual solution, you need to sum up the following profits for each individual author:

All advances which is calculated exactly once for each title. <br/>
All royalties in each sale.

Therefore, you will not be able to achieve the goal with a single SELECT query. Instead, you will need to follow several steps in order to achieve the eventual solution. Below is an overview of the steps:

1. Calculate the royalty of each sale for each author.

2. Using the output from Step 1 as a temp table, aggregate the total royalties for each title for each author.

3. Using the output from Step 2 as a temp table, calculate the total profits of each author by aggregating the advances and total royalties of each title.

Below we'll guide you through each step. In your solutions.sql, please include the SELECT queries of each step so that your TA can review your problem-solving process.

### Step 1: Calculate the royalties of each sales for each author

Write a SELECT query to obtain the following output:

Title ID <br/>
Author ID <br/>
Royalty of each sale for each author <br/>
The formula is: <br/>
sales_royalty = titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100

Note that titles.royalty and titleauthor.royaltyper are divided by 100 respectively because they are percentage numbers instead of floats.

In the output of this step, each title may appear more than once for each author. This is because a title can have more than one sales.

In [8]:
%%sql

SELECT * FROM titleauthor
limit 3;

 * mysql+mysqldb://root:***@localhost/publications
3 rows affected.

[('172-32-1176', 'PS3333', 1, 100),
 ('213-46-8915', 'BU1032', 2, 40),
 ('213-46-8915', 'BU2075', 1, 100)]

In [9]:
%%sql

SELECT au_id, titles.title_id, (titles.price * sales.qty * (titles.royalty / 100) * (titleauthor.royaltyper / 100)) as royalty 
FROM sales
JOIN titles
ON titles.title_id = sales.title_id
JOIN titleauthor
ON titleauthor.title_id = titles.title_id;

 * mysql+mysqldb://root:***@localhost/publications
34 rows affected.

[('213-46-8915', 'BU1032', Decimal('3.998000000000')),
 ('409-56-7008', 'BU1032', Decimal('5.997000000000')),
 ('899-46-2035', 'PS2091', Decimal('1.971000000000')),
 ('998-72-3567', 'PS2091', Decimal('1.971000000000')),
 ('427-17-2319', 'PC8888', Decimal('50.000000000000')),
 ('846-92-7186', 'PC8888', Decimal('50.000000000000')),
 ('899-46-2035', 'PS2091', Decimal('49.275000000000')),
 ('998-72-3567', 'PS2091', Decimal('49.275000000000')),
 ('899-46-2035', 'PS2091', Decimal('6.570000000000')),
 ('998-72-3567', 'PS2091', Decimal('6.570000000000')),
 ('807-91-6654', 'TC3218', Decimal('83.800000000000')),
 ('648-92-1872', 'TC4203', Decimal('33.460000000000')),
 ('267-41-2394', 'TC7777', Decimal('8.994000000000')),
 ('472-27-2349', 'TC7777', Decimal('8.994000000000')),
 ('672-71-3249', 'TC7777', Decimal('11.992000000000')),
 ('899-46-2035', 'PS2091', Decimal('13.140000000000')),
 ('998-72-3567', 'PS2091', Decimal('13.140000000000')),
 ('722-51-5454', 'MC3021', Decimal('13.455000000000')),
 ('899-46-2035', 'MC3021', Decimal('4.485000000000')),
 ('724-80-9391', 'PS1372', Decimal('10.795000000000')),
 ('756-30-7391', 'PS1372', Decimal('32.385000000000')),
 ('998-72-3567', 'PS2106', Decimal('17.500000000000')),
 ('172-32-1176', 'PS3333', Decimal('29.985000000000')),
 ('486-29-1786', 'PS7777', Decimal('19.975000000000')),
 ('274-80-9391', 'BU7832', Decimal('29.985000000000')),
 ('712-45-1867', 'MC2222', Decimal('23.988000000000')),
 ('213-46-8915', 'BU2075', Decimal('25.116000000000')),
 ('722-51-5454', 'MC3021', Decimal('8.073000000000')),
 ('899-46-2035', 'MC3021', Decimal('2.691000000000')),
 ('213-46-8915', 'BU1032', Decimal('7.996000000000')),
 ('409-56-7008', 'BU1032', Decimal('11.994000000000')),
 ('267-41-2394', 'BU1111', Decimal('11.950000000000')),
 ('724-80-9391', 'BU1111', Decimal('17.925000000000')),
 ('238-95-7766', 'PC1035', Decimal('110.160000000000'))]

### Step 2: Aggregate the total royalties for each title for each author

Using the output from Step 1, write a query to obtain the following output:

Title ID <br/>
Author ID <br/>
Aggregated royalties of each title for each author. Hint: use the SUM subquery and group by both au_id and title_id <br/>

In the output of this step, each title should appear only once for each author.

In [121]:
%%sql

SELECT au_id, title_id, SUM(royalty) as royalty
FROM (
    SELECT titles.title_id, au_id, (titles.price * sales.qty * (titles.royalty / 100) * (titleauthor.royaltyper / 100)) as royalty 
    FROM sales
    JOIN titles
    ON titles.title_id = sales.title_id
    JOIN titleauthor
    ON titleauthor.title_id = titles.title_id
) summary
GROUP BY au_id, title_id;

 * mysql+mysqldb://root:***@localhost/publications
24 rows affected.

[('213-46-8915', 'BU1032', Decimal('11.994000000000')),
 ('409-56-7008', 'BU1032', Decimal('17.991000000000')),
 ('899-46-2035', 'PS2091', Decimal('70.956000000000')),
 ('998-72-3567', 'PS2091', Decimal('70.956000000000')),
 ('427-17-2319', 'PC8888', Decimal('50.000000000000')),
 ('846-92-7186', 'PC8888', Decimal('50.000000000000')),
 ('807-91-6654', 'TC3218', Decimal('83.800000000000')),
 ('648-92-1872', 'TC4203', Decimal('33.460000000000')),
 ('267-41-2394', 'TC7777', Decimal('8.994000000000')),
 ('472-27-2349', 'TC7777', Decimal('8.994000000000')),
 ('672-71-3249', 'TC7777', Decimal('11.992000000000')),
 ('722-51-5454', 'MC3021', Decimal('21.528000000000')),
 ('899-46-2035', 'MC3021', Decimal('7.176000000000')),
 ('724-80-9391', 'PS1372', Decimal('10.795000000000')),
 ('756-30-7391', 'PS1372', Decimal('32.385000000000')),
 ('998-72-3567', 'PS2106', Decimal('17.500000000000')),
 ('172-32-1176', 'PS3333', Decimal('29.985000000000')),
 ('486-29-1786', 'PS7777', Decimal('19.975000000000')),
 ('274-80-9391', 'BU7832', Decimal('29.985000000000')),
 ('712-45-1867', 'MC2222', Decimal('23.988000000000')),
 ('213-46-8915', 'BU2075', Decimal('25.116000000000')),
 ('267-41-2394', 'BU1111', Decimal('11.950000000000')),
 ('724-80-9391', 'BU1111', Decimal('17.925000000000')),
 ('238-95-7766', 'PC1035', Decimal('110.160000000000'))]

### Step 3: Calculate the total profits of each author

Now that each title has exactly one row for each author where the advance and royalties are available, we are ready to obtain the eventual output. Using the output from Step 2, write a query to obtain the following output:

Author ID <br/>
Profits of each author by aggregating the advance and total royalties of each title

Sort the output based on a total profits from high to low, and limit the number of rows to 3.

In [150]:
%%sql

SELECT au_id, (SUM(royalty)+SUM(advance)) as total_profit
    FROM (
        SELECT au_id, title_id, SUM(royalty) as royalty, advance
        FROM (
            SELECT titles.title_id, au_id, (titles.price * sales.qty * (titles.royalty / 100) * (titleauthor.royaltyper / 100)) as royalty, 
            ((advance*royaltyper)/100) as advance 
            FROM sales
            JOIN titles
            ON titles.title_id = sales.title_id
            JOIN titleauthor
            ON titleauthor.title_id = titles.title_id
        ) summary
        GROUP BY au_id, title_id
    ) summary2
GROUP BY au_id
ORDER BY total_profit DESC
limit 3;

 * mysql+mysqldb://root:***@localhost/publications
3 rows affected.

[('213-46-8915', Decimal('12162.110000000000')),
 ('722-51-5454', Decimal('11271.528000000000')),
 ('998-72-3567', Decimal('7225.956000000000'))]

### Challenge 2 - Alternative Solution

In the previous challenge, you may have developed your solution in either of the following ways:

Derived tables <br/>
Creating MySQL temporary tables in the initial steps, and query the temporary tables in the subsequent steps.

Either way you have used, we'd like you to try the other way.

Additional Learning <br/>
In the context of this lab, you may use either the derived table or the temp table way to develop the solution. You may feel the former is more convenient than the latter way. However, you need to know each way is suitable in certain contexts. Derived tables are kept in the MySQL runtime memory and will be lost once the query execution is completed. In contrast, temp tables are physically -- though temporarily -- stored in MySQL. As long as your user session is not expired, you can access the data in the temp tables readily.

If the data in your database are changing frequently, each time when you use derived tables to retrieve information, you may find the results are different. In contrast, once the temp tables are created, the data stored in the temp tables are persistent. Even if the relevant data in your database have changed, the data in the temp tables will remain the same unless you have updated the temp data. Therefore, if you care about the timeliness of the results, you should use derived tables so that you will always receive the latest information.

However, if your data are massive and queries are complicated, you receive signficiant performance benefits by using temp tables. Because when you use temp tables, the time-consuming calculations (which we call expensive database transactions) are only performed once and the results are persistent. When you query the temp tables repeatedly, you will not perform expensive transactions again and again in your database.

In [151]:
%%sql 

CREATE TEMPORARY TABLE royalties_persale_perauthour_
SELECT au_id, titles.title_id, (titles.price * sales.qty * (titles.royalty / 100) * (titleauthor.royaltyper / 100)) as royalty, 
((advance*royaltyper)/100) as advance  
FROM sales
JOIN titles
ON titles.title_id = sales.title_id
JOIN titleauthor
ON titleauthor.title_id = titles.title_id;

 * mysql+mysqldb://root:***@localhost/publications
34 rows affected.

[]

In [152]:
%%sql 

CREATE TEMPORARY TABLE royalties_pertitle_perauthor_
SELECT au_id, title_id, SUM(royalty) as royalty, advance 
FROM royalties_persale_perauthour_
GROUP BY au_id, title_id, advance;

 * mysql+mysqldb://root:***@localhost/publications
24 rows affected.

[]

In [155]:
%%sql 

SELECT au_id, (SUM(royalty)+SUM(advance)) as total_profit FROM royalties_pertitle_perauthor_
GROUP BY au_id
ORDER BY total_profit DESC;

 * mysql+mysqldb://root:***@localhost/publications
19 rows affected.

[('213-46-8915', Decimal('12162.110000000000')),
 ('722-51-5454', Decimal('11271.528000000000')),
 ('998-72-3567', Decimal('7225.956000000000')),
 ('238-95-7766', Decimal('7110.160000000000')),
 ('807-91-6654', Decimal('7083.800000000000')),
 ('756-30-7391', Decimal('5282.385000000000')),
 ('274-80-9391', Decimal('5029.985000000000')),
 ('899-46-2035', Decimal('4965.632000000000')),
 ('724-80-9391', Decimal('4778.720000000000')),
 ('267-41-2394', Decimal('4420.944000000000')),
 ('427-17-2319', Decimal('4050.000000000000')),
 ('846-92-7186', Decimal('4050.000000000000')),
 ('648-92-1872', Decimal('4033.460000000000')),
 ('486-29-1786', Decimal('4019.975000000000')),
 ('672-71-3249', Decimal('3211.992000000000')),
 ('409-56-7008', Decimal('3017.991000000000')),
 ('472-27-2349', Decimal('2408.994000000000')),
 ('172-32-1176', Decimal('2029.985000000000')),
 ('712-45-1867', Decimal('23.988000000000'))]

### Challenge 3

Elevating from your solution in Challenge 1 & 2, create a permanent table named most_profiting_authors to hold the data about the most profiting authors. The table should have 2 columns:

au_id - Author ID <br/>
profits - The profits of the author aggregating the advances and royalties

In [159]:
%%sql

CREATE TABLE most_profiting_authors
SELECT au_id, (SUM(royalty)+SUM(advance)) as total_profit FROM royalties_pertitle_perauthor_
GROUP BY au_id
ORDER BY total_profit DESC;

 * mysql+mysqldb://root:***@localhost/publications
19 rows affected.

[]

In [160]:
%%sql

SELECT * FROM most_profiting_authors

 * mysql+mysqldb://root:***@localhost/publications
19 rows affected.

[('213-46-8915', Decimal('12162.110000000000')),
 ('722-51-5454', Decimal('11271.528000000000')),
 ('998-72-3567', Decimal('7225.956000000000')),
 ('238-95-7766', Decimal('7110.160000000000')),
 ('807-91-6654', Decimal('7083.800000000000')),
 ('756-30-7391', Decimal('5282.385000000000')),
 ('274-80-9391', Decimal('5029.985000000000')),
 ('899-46-2035', Decimal('4965.632000000000')),
 ('724-80-9391', Decimal('4778.720000000000')),
 ('267-41-2394', Decimal('4420.944000000000')),
 ('427-17-2319', Decimal('4050.000000000000')),
 ('846-92-7186', Decimal('4050.000000000000')),
 ('648-92-1872', Decimal('4033.460000000000')),
 ('486-29-1786', Decimal('4019.975000000000')),
 ('672-71-3249', Decimal('3211.992000000000')),
 ('409-56-7008', Decimal('3017.991000000000')),
 ('472-27-2349', Decimal('2408.994000000000')),
 ('172-32-1176', Decimal('2029.985000000000')),
 ('712-45-1867', Decimal('23.988000000000'))]

Additional Learning <br/>
To balance the performance of database transactions and the timeliness of the data, software/data engineers often schedule automatic scripts to query the data periodically and save the results in persistent summary tables. Then when needed they retrieve the data from the summary tables instead of performing the expensive database transactions again and again. In this way, the results will be a little outdated but the data we want can be instantly retrieved.